package task1;
// Написать программу, которая производит математические операции на двумя переменными a и b и вывести результаты на экран.
//Т.е. должны быть выведены сумма, разность, произведение и частное. Попробуйте с разными типами данных a и b.
public class task1 {

        public static void main(String[] args) {

                float a = 1248;
                float b = 124;

                System.out.println(a+b);
                System.out.println(a-b);
                System.out.println(a*b);
                System.out.println(a/b);
        }
}